


Арсений:
    https://www.youtube.com/watch?v=6s7g1QtadGE&feature=youtu.be

    Осн задача - Надо прогнозировать активность катализаторного комплекса (КК)
    Цель1 - снизить расход КК (дорогой)
    Цель2 - получать продукт стабильного качества
    Доп задача - прогнозировать долю побочного продукта

    Данные - установка полимеризации за год (неочищенные)
    Помощь - база знаний (выжимка о нефтехим процессах)


Покупка
    Полипропилен
        "стабилизаторами"
            Из-за наличия дополнительного атома углерода, «торчащего» из цепочки, полипропилен
                более чувствителен к свету и кислороду. Для снижения этого влияния в полипропилен
                вводят специальные вещества, называемые стабилизаторами: они тормозят
                деструктивные процессы в полимере.
        "изотактической"
            характеристики полипропилена существенно зависят от того, как
                звенья ориентируются по отношению друг к другу. Например, цепочка, где все боковые
                атомы углерода находятся по одну сторону, называется изотактической
        "Синдиотактической"
            Если боковые углероды строго чередуются, то цепочка называется синдиотактической.
        "АТАКТИКА"
            А вот если расположение боковых атомов носит
                хаотический характер, то такая структура называется атактической
            Атактический полипропилен - мягкий,
            эластичный и каучукободобный материал и по своим свойствам он хуже, чем
            синтетический и натуральный каучук, поэтому он является побочным продуктом

    История полипропилена 
        1850 начало
        сперва атактика безконтрольная
        реакция не поддавалась контролю. Забвение.
        1950 - второе рождение - начали применять катализаторы для контроля
        1952 году Карл Циглер - с синтетическими каучуками -  синтез полиэтилена
        1953 году Милан- Джулио Натта модифицировал каталитические системы Циглера
            полимеризации различных олефинов, в частности пропилена
            коренным образом отличалось - больший молекулярный вес, кристаллизоваться, четкий температурный диапазон плавления, плотность,  меньше растворялось 
            был изотактическим или синдиотактическим
        1963 Джулио Натта получил Нобелевскую премию по химии
            примененные им стереоспецифические катализаторы полимеризации с тех пор
            называются катализаторами Циглера-Натта.
        1965 - В СССР производство полипропилена началось в 1965 году на Московском НПЗ,
        1977 в Гурьеве заработал завод, выпускающий полипропилен по итальянской технологии. В 
        1982 был пущен мощный нефтехимический комплекс в Томске

    Производство полипропилена
        виды сырья:
            - пропилен пиролиза, 
            - пропилен нефтезаводских газов и 
            - пропилен, полученный дегидрированием индивидуального пропана
        Процесс:
            - 70 – 80 °С
            - 10 атмосфер
            - в среде растворителя (им может выступать обычный бензин)
            - в присутствии катализаторов (стереорегулярной полимеризации)
        Далее:
            - "суспензия готового полипропилена" в растворителе отделяется от непрореагировавшего пропилена
            - "катализатор" разлагается
            - "полимер" отделяется от растворителя, сушится и отправляется на гранулирование


Активность катализатора
    https://ru.wikipedia.org/wiki/Активность_катализатора#Гомогенный_катализ
    Гомогенным принято называть катализ, при котором катализатор и реагирующие вещества находятся в одной фазе. При гомогенном катализе для сравнения и характеристики катализатора используют скорость реакции, отнесенную к единице концентрации катализатора.[1]

Катализаторы Циглера — Натта
    https://ru.wikipedia.org/wiki/Катализаторы_Циглера_—_Натта



Заводы сибура
    https://www.sibur.ru/about/structure/
    https://www.sibur.ru/search/?q=%D0%BF%D0%BE%D0%BB%D0%B8%D0%BF%D1%80%D0%BE%D0%BF%D0%B8%D0%BB%D0%B5%D0%BD&go=
    big data
    https://www.sibur.ru/press-center/publications/YApytayusotuchitsotrudnikovotslovaagile/
    диплом про тобольск - https://dspace.tltsu.ru/bitstream/123456789/7501/1/%D0%96%D0%B8%D0%BB%D1%8C%D1%86%D0%BE%D0%B2%20%D0%A1.%D0%90._%D0%A5%D0%A2%D0%B1%D0%B7-1331.pdf
    реферат про полипропилен - http://window.edu.ru/catalog/pdf2txt/298/75298/56008?p_page=5
    изобретение - два первичных реактора - https://findpatent.ru/patent/253/2535483.html
    оператор - https://edrid.ru/rid/216.013.0fe2.html


Полипропилен
    https://ru.wikipedia.org/wiki/Полипропилен




Вебинар 2
    активность катализатора - рассчетная величина на основе других датчиков
    на основе показаний каких приборов она рассчитывается?
        формулу не даст
        на основе предоставленных данных 
    влияет ли Темп окружающего воздуха на расход пропилена
        напрямую нет, но влияет на тепловой баланс
    на что влияет f37;Давление сдувок на этилен;Па
        сдувки пропилена - влияет на рассчет конверсии (то кол-во пропилена, которое вступило в реакцию)
    в составе исохдного сырья пропилена есть ли яды?
        есть, но содержание стабильно
    мы научились предсказывать активность сможет ли оператор на основе предсказаний ее увеличивать?
        да, элементы управления, подать катализатор
        оператор управляет прежде всего расходами в первичные реактора
    есть ли оптимум активности, который держит оператор или чем больше тем лучше?
        в идеале - чем выше активность, тем лучше, но всетаки есть достигаемый оптимум, который надо выдерживать
        но цифр не назову
    кроме активности есть другие метрики, оптимизируя которые оператор роняет активность?
        да
    влажность воздуха - только для взвешивания?
        нет, но не скажу думайте
    одна и та же марка катализатора в данных
        да
    время полного цикла от загрузки сырья до продукта
        в реакторном блоке - 6 часов
        компоненты в реакционной среде всех трех реакторов находятся 6 часов
    как будут отсеивать модели подглядывающие в будущее                        
        вручную (интерполяция -> дисквалификация)
    установка не под открытым небом


Нефрас («нефтяной растворитель») — собирательное название жидкостей, являющихся продуктами перегонки нефти, таких как бензин, керосин, уайт-спирит и других, используемых на производстве и в быту как растворители

Задача 
    Прогноз активности катализатора
    На одном из предприятий СИБУР действует установка полимеризации пропилена. Ее основной продукт - гомополимер пропилена. В этой задаче вы должны построить прогноз активности катализатора, который используется в процессе полимеризации. Для решения задачи вам доступны исторические данные о работе установки.

    Целевой переменной в этой задаче является активность катализатора, а прогноз должен строиться на 6 часов вперед.

    В работе установки в тестовый период было несколько остановов. Активность во время остановов и сразу после них предсказывать не нужно, а точный набор временных меток, для которых необходимо построить прогноз, доступен в файле activity_test_timestamps.csv.

    Данные
    Установка полимеризации пропилена

    Установка полимеризации пропилена – технологический комплекс, предназначенный для получения порошка гомополимера пропилена.

    Полимеризация осуществляется в каскаде из трех изотермических реакторов идеального перемешивания непрерывного действия в растворе в среде тяжелого растворителя (нефраса). Технологическим предшественником реакторного блока является блок приготовления катализаторного комплекса с форполимеризацией (емкости D1 и D2).

    Два первичных реактора (R1 и R2) работают параллельно и независимо. Реакционная среда из них в постоянном режиме перегружается в общий вторичный реактор (R3), где происходит дополимеризация.

    В процессе используется катализатор, активность которого нужно прогнозировать в этой задаче.





Диплом
    1.2 Каталитическая система
        В состав высокоактивной каталитической системы CDi входят
        следующие компоненты [4]:
            Катализатор CDi;
            Сокатализатор - триэтилалюминий (TЭА);
            Внешний донор – соединение на основе силана

        Катализатор CDi состоит из тетрахлорида титана (TiCl4) и внутреннего
        донора (ди-н-бутилфталата или ДБФ) на подложке из хлорида магния
        (MgCl2)

        Цвет частиц катализатора обычно варьируется от бледно-желтого до
    ярко-желтого.
         Катализатор поставляется компанией BASF в виде суспензии в
        минеральном масле, содержащей 30% масс. катализатора.

        Триэтилалюминий поставляется в чистом 
        14
        (нерастворенном) виде и загружается в реактор непосредственно из
            транспортного контейнера [5

        1.2.3 Внешний донор на основе силана
            для обеспечения дополнительной стереоспецифичности
            Если не использовать внешний донор на основе силана, то, несмотря на
            присутствие внутреннего донора в частицах катализатора, будет
            образовываться чрезмерное количество атактического полимера

            Увеличение подачи донора на основе силана обычно приводит к уменьшению доли
                атактической фракции, но снижает производительность катализатора
            Еще одним преимуществом использования донора на основе силана является его 
                способность замедлять распад катализатора, что позволяет существенно
                увеличить время протекания реакций
            диизобутил-диметоксисилан


        Несмотря на то, что для подачи триэтилалюминия и силана
        используются различные подающие насосы, оба потока объединяются и
        поступают в реактор по одной трубе

При смешивании двух компонентов
незамедлительно образуется относительно стабильный комплекс
триэтилалюминия и силана (1:1).

Ни один из продуктов реакции с участием силана не действует как
донор. 
Таким образом, раздельная подача
триэтилалюминия и силана снижает интенсивность протекания данных
реакций.




Реакция полимеризации
        1. Активация: сокатализатор триэтилалюминий вступает в реакцию с
            TiCl4 на поверхности катализатора на подложке и снижает степень окисления
            Ti с (+4) до (+3), активируя, таким образом, Ti для полимеризации. Между
            триэтилалюминием и активным центром происходит реакция алкилирования
            с образованием связи Ti-C.
            TiCl4 + Al(C2H5)3→TiCl3 + Al(C2H5)2Сl +0,5C2H4+0,5C2H6
        2. Инициирование: молекула пропилена встраивается в связь Ti-C на
            активном центре, формируя, таким образом, начало полипропиленовой цепи.
        3. Рост цепи
        4. Обрыв цепи:
            1) передача цепи с помощью мономера:
            Ti-CH2-CH(CH3)-P+CH2=CH-CH3→Ti-CH2-CH2-CH3+CH2=C(CH3)-P
            2) передача цепи с помощью сокатализатора:
            Ti-CH2-CH(CH3)-P+AlR3→Ti-R+R2Al-CH2-CH(CH3)-P
            3) передача цепи с помощью водорода:
            Ti-CH2-CH(CH3)-P+H2→Ti-H+CH3-CH(CH3)-P
            Молекула водорода самостоятельно встраивается в активный центр и
            обрывает цепь за счет образования на ее конце метильной группы (« —CH3»).
            Из всех трех вышеуказанных реакций передача цепи с помощью
            водорода является наиболее эффективным процессом обрыва полимерной
            цепи. 
        
        Водород
            Водород используется для контроля молекулярной массы полимера.
                Увеличение концентрации водорода приводит к повышению скорости
                реакции обрыва полимерной цепи, вследствие чего образуются более 
                24
                короткие полимерные цепи, имеющие меньшую молекулярную массу.
                Аналогичным образом, снижение концентрации водорода ведет к снижению
                скорости реакции обрыва полимерной цепи, вследствие чего образуются
                более длинные полимерные цепи, имеющие большую молекулярную массу. 





1.5 Кинетика гомополимеризации пропилена
Скорость образования
изотактического полипропилена определяется с применением модели,
основанной на скорости реакции, тогда как скорость образования
атактического полипропилена рассчитывается исходя из корреляций,
базирующихся на технологических режимах и показателя течения расплава
продукта

описание кинетической модели гомополимеризации
пропилена с использованием катализатора CD и внешнего модификатора
ДИБДМС.


ro = первоначальная скорость полимеризации (или скорость роста
полимерной цепи) в г/ч-г катализатора
r0 =
    молярная концентрация пропилена на поверхности катализатора
    *
    константа скорости реакции 
    *
    молярная масса пропилена




Многочисленные экспериментальные и теоретические исследования
показали, что скорость полимеризации пропилена снижается сразу же после
начала реакции

В ходе дальнейших экспериментов
обнаружилось, что процесс деактивации не зависит от концентрации
мономера пропилена

Если подставить указанное выше значение Kd в уравнение (1.4), то
ожидаемый период полураспада составит около 55 мин





Скорость полимеризации зависит от отношения концентраций
следующих компонентов в реакторе [6]:
1. Сокатализатор/катализатор: 
2. Модификатор/сокатализатор:
3. Водород/пропилен:

Опыты Натта позволяют заключить, что в процессе полимеризации
активность катализатора со временем существенных изменений не
претерпевает, скорость полимеризации прямо пропорциональна количеству
TiCl3, т.е. величине поверхности; давлению мономера и не зависит от
концентрации триэтилалюминия.


С
повышением температуры увеличивается скорость реакции и выход
полипропилена.  выше 80 град - атактика

во сколько раз увеличится давление, во столько раз
увеличится полимеризация



Триэтилалюминий (Al(C2H5)3) – металлоорганическое соединение,
прозрачная, бесцветная жидкост


2.3 Описание технологической схемы установки полимеризации
Пропилен подается по трубопроводу на установку полимеризации с
температурой 10 0С, давлением 3,30 МПа, расходом 66000 кг/ч.
Водород подаётся по трубопроводу на установку полимеризации с
температурой 38 °С, давлением 4,50 МПа, расходом 27 кг/ч в линию
рециркулирующего газа.
С ростом
концентрации водорода в реакционной среде будет увеличиваться показателя
текучести расплава

Донор (диизобутил-диметоксисилан) доставляется на установку в
контейнерах объемом 1,13 м3
, которые помещаются на весовые платформы;
либо в бочках объемом 200 литров



Реактор представляет собой горизонтальный цилиндрический аппарат
диаметром 3,048 метр

 Отходящий газ отводится из реактора через
два купола – первичные циклоны, препятствующие уносу порошка


 Постоянный уровень слоя крайне важен для поддержания качества
продукта. Уровень всегда должен быть выше вала мешалки реактора, чтобы
свести к минимуму образование комков

Полимеризация протекает при температуре 60-70 0С и давлении 2,0-
2,23 МПа. Порошок полипропилена периодически выгружается в рукавный
фильтр газа - через клапаны выгрузки, которые открываются на заданный
промежуток времени.


Отходящий газ, в основном пропилен, отводится
из центральной части реактора через два купола в верхней его части. 

Избыточное количество жидкого пропилена смачивает слой порошка,
препятствует нормальному перемешиванию, снижает текучесть порошка, 
59
затрудняет выгрузку. В то же время высокая температура реакции
способствует плавлению порошка, образованию комков


поверхность слоя порошка не
горизонтальна, а расположена под углом к горизонтальной плоскости.
Форсунки подачи жидкого пропилена и рециркулирующего газа
расположены на корпусе ректора так, чтобы обеспечить подачу
перпендикулярно поверхности слоя порошка.



Основной функцией рециркулирующего газа является распределение
водорода в реакторе.


 Кислород является сильным каталитическим ядом, способным
очень резко снизить активность катализатора. Это обеспечивает возможность
снизить производительность реактора 


добавление пропилена к катализатору обусловливает
необходимость разделения потоков катализатора и сокатализатора во
избежание реакции и последующей забивки питающей линии.


Катализатор поставляется в виде 30% весовых суспензии в
минеральном масле [15

Для потоков сокатализатора / модификатора порядок смешивания
очень важен из-за самовоспламеняющегося характера сокатализатора (ТЭА)



Мешалка имеет
двигатель с фиксированной скоростью (750 кВт) и вращением 15 об / мин


3 Расчетная часть




ВНУТРИ:

    












